# 조건문 (if)
'''
[문제] 도어락 비밀번호

[출력결과]
비밀번호는 무엇입니까?  0529
문이 열렸습니다.

'''



'''
[문제] 이름을 묻고 반 배치 시키기

[출력결과]
이름이 무엇입니까?  라이언
3학년 6반으로 가시면 됩니다.

이름이 무엇입니까?  어피치
3학년 2반으로 가시면 됩니다.

'''



'''
[문제] 15세 이상 영화등급 구분

[출력결과]
당신의 나이는?  17
이 등급의 영화를 볼 수 있습니다. 

'''



'''
[문제] 공무원 시험 과락 판별
공무원 시험은 보통 필수 3과목(국어, 영어, 한국사)와 선택 2과목으로 나눠진다. 이중 어느 한 과목이라도 40점 미만이면 과락이다. 한 해 응시자 중 평균 50% 정도 과락이 발생한다.
점수를 입력 받은 후 어느 한 과목 이하라도 40점 미만일 경우 “과락”을 출력하고, 반대의 경우 “과락 아님”을 출력하시오.

[출력결과]
국어 점수 : 70
영어 점수 : 90
한국사 점수 : 100
선택과목 1 점수 : 60
선택과목 2 점수 : 55
과락 아님
    
'''

