# 반복문
'''
[문제] while 문을 이용해서 1부터 100까지의 홀수만 출력하기

[출력결과]
1
3
5
...
97
99

'''



'''
[문제] 주인공 체력 계산
while문을 이용하여 숫자로 데미지를 입힌 후 체력이 0이 되면 종료하게 만들기

[출력결과]
주인공의 체력은 100 입니다.
얼마의 데미지를 입히겠습니까 : 50
주인공의 체력은 50 입니다.
얼마의 데미지를 입히겠습니까 : 40
주인공의 체력은 10 입니다.
얼마의 데미지를 입히겠습니까 : 10
주인공의 체력은 0이 되어 종료됩니다!

'''



'''
[문제] for문을 이용해서 1~5까지의 숫자들을 차례대로 출력하기

[출력결과]
1 2 3 4 5
    
'''



'''
[문제] for문을 이용해서 1부터 10까지의 합을 구하시오.

[출력결과]
1부터 10까지의 합 : 55

'''



'''
[문제] for문을 이용해서 1부터 100사이의 정수 중 5와 7의 공배수 출력하기

[출력결과]
35 : 5와 7의 공배수!!
70 : 5와 7의 공배수!!

'''
