# 셸에서 간단한 수학계산 해보기(연산자 우선순위 알아보기)
'''
[문제]
• 괄호가 포함된 계산 5 * (10 + 10) / 2를 수행하여 보자.
• 괄호를 제외하고 5 * 10 + 10 / 2를 수행하여 결과를 비교해 보자.




[문제]
국립환경과학원에서는 아파트에서 수음이 가장 심한 층수를 구하는 계산식을 발표했다.
소음이 가장 심한 층은 0.2467 * 도로와의 거리(m) + 4.159이다.
소음이 가장 심한 층수를 출력해 보자. 단, 층수를 출력할때는 정수로 출력.

--> 도로와의 거리 : 12m




[문제]
L이라는 게임에서 "왜곡"이라는 스킬이 AP * 0.6 + 225의 피해를 준다.
이 게임에서 AP(Ability Power, 주문력)는 마법 능력치를 뜻한다.
스킬의 피해량을 출력해 보자.

--> AP : 102



'''


# 셸에서 출력해보기(변수 이용)
'''
[문제]
• ‘b’라는 변수를 설정하고 음수 3을 저장한 후 출력하여 보자. 

• 자신의 이름을 변수명으로 한 후 자신의 나이를 할당하여 보자.




'''

# 셸에서 변수를 이용해서 간단한 계산해보기
'''

[문제]
홍길동의 과목별 점수는 다음과 같다. 홍길동의 평균 점수를 구해 보자.

국어 : 80
영어 : 75
수학 : 55




'''

# print문
'''
[문제]
print문을 이용해서 다이아몬드 모양 출력해보기(단순하게 print문만 사용)

[출력결과]
    *    
   ***   
  *****  
*********
  *****  
   ***   
    *   





[문제]
날짜와 시간이 출력되게 만들기

[출력결과]
2000/10/27 11:43:59





[문제]
애국가 여러줄 출력해보기

[출력결과]

동해물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라 만세
무궁화 삼천리 화려 강산
대한사람 대한으로 길이 보전하세

'''
